{
  "todo" : {
      "mini": "Простой список задач с базовым функционалом: добавление, завершение, редактирование, удаление задач. Также присутствует список завершенных задач.",
      "base": "Простой список задач с базовым функционалом: добавление, завершение, редактирование, удаление задач. Также присутствует список завершенных задач."
  },
  "pizza" : {
      "mini": "Веб-сайт для заказа пиццы. Присутствует функционал выборки пицц по категориям, поиска по названию, сортировки по популярности.",
      "base": "Веб-сайт для заказа пиццы. Присутствует функционал выборки пицц по категориям, поиска по названию, сортировки по популярности. Пиццы можно добавлять в корзину, каждый тип теста и размер пиццы имеет свою цену и добавляется в корзину как отдельный товар. Сайт корректно отображается на любом устройстве (320 - 4096)px."
  },
  "weather" : {
      "mini": "Сайт для просмотра прогноза погоды. Для получения данных о погоде используется Openweathermap API.",
      "base": "Сайт для просмотра прогноза погоды. Для получения данных о погоде используется Openweathermap API. Присутствует функционал поиска города, вывода информации о погоде посуточно, либо в формате на каждые три часа. Также последние выбранные города сохраняются в localStorage и для быстрого доступа к истории можно использовать select, который находится в шапке сайта. Также присутствует функционал смены светлой и темной темы. Верстка является респонсивной и подстраивается под любой размер экрана."
  },
  "movies" : {
      "mini": "Это приложение для поиска фильмов. Оно использует moviesdatabase.p.rapidapi.com для получения информации о фильмах.",
      "base": "Это приложение для поиска фильмов, построенное с использованием React, Redux-Toolkit и TypeScript. Оно использует moviesdatabase.p.rapidapi.com для получения информации о фильмах. В приложение присутствует широкий функционал по поиску фильмов, выборки по категории, дате выхода и жанру. Каждый фильм имеет свою страницу с подробностями о нем. Для сериалов также отображаются их серии по сезонам. Также присутствует функционал добавление фильма в избранное. Приложение выложено на хостинге vercel."
  },
  "chat" : {
    "mini": "Веб-сайт с функционалом чата. Aутентификация и хранение данных о чатах и пользователях с использованием google firebase.",
    "base": "Веб-сайт с функционалом чата.  Aутентификация и хранение данных о чатах и пользователях с использованием google firebase.\nПрисутствует функционал регистрации и входа в аккаунт (с использованием почты / google аккаунта, поиска пользователей по username, отправки и получения сообщений в реальном времени, отправки файлов вместе с текстом, удаления чата для обоих пользователей, редактирования личной информации (username, avatar), смены темы приложения, смены языка (русский, english). Сайт корректно отображается на любом устройстве (320 - 4096)px."
  },
  "me": {
    "heading": "Я Михаил, фронтенд разработчик",
    "subheading": "Я создаю вебсайты используя современные инструменты разработки и стараюсь развивать свои навыки углубляясь в эту сферу.",
    "contactme": "Связаться со мной"
  },
  "links": {
    "home": "главная",
    "works": "мои проекты"
  }

}